modm-ext/data.modm.io/docs/svd/header_stm32g0b1xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP12_COMMON</name>
      <groupName>COMP_Common</groupName>
      <alternatePeripheral>COMP1</alternatePeripheral>
      <baseAddress>0x40010200</baseAddress>
      <registers>
        <register>
          <name>CSR_ODD</name>
          <description>COMP control and status register located in register of comparator instance odd (exception for STM32G0 devices featuring ADC3 instance: in common group of COMP2 and COMP3, instances odd and even are inverted), used for bits common to several COMP instances</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Comparator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator input minus selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINUS_1_4VREFINT</name>
                  <description>Comparator input minus connected to 1/4 VrefInt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_2VREFINT</name>
                  <description>Comparator input minus connected to 1/2 VrefInt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_3_4VREFINT</name>
                  <description>Comparator input minus connected to 3/4 VrefInt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>Comparator input minus connected to VrefInt</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH1</name>
                  <description>Comparator input minus connected to DAC1 channel 1 (DAC_OUT1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH2</name>
                  <description>Comparator input minus connected to DAC1 channel 2 (DAC_OUT2)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input minus connected to IO1 (pin PB1 for COMP1, pin PB3 for COMP2, pin PB2 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input minus connected to IO2 (pin PC4 for COMP1, pin PB7 for COMP2, pin PC0 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input minus connected to IO3 (pin PA0 for COMP1, pin PA2 for COMP2, pin PE8 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator plus minus selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input plus connected to IO1 (pin PC5 for COMP1, pin PB4 for COMP2, pin PB0 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input plus connected to IO2 (pin PB2 for COMP1, pin PB6 for COMP2, pin PC1 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input plus connected to IO3 (pin PA1 for COMP1, pin PA3 for COMP2, pin PE7 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINOUT</name>
              <description>Pair of comparators window output level. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator input hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Hysteresis level low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Hysteresis level medium</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Hysteresis level high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>COMP power mode to high speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to medium speed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKING</name>
              <description>Comparator blanking source</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC4</name>
                  <description>Comparator output blanking source TIM1 OC4 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5</name>
                  <description>Comparator output blanking source TIM1 OC5 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3</name>
                  <description>Comparator output blanking source TIM2 OC3 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3</name>
                  <description>Comparator output blanking source TIM3 OC3 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_OC2</name>
                  <description>Comparator output blanking source TIM15 OC2 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALUE</name>
              <description>Comparator output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCK</name>
              <description>Comparator lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR_EVEN</name>
          <description>COMP control and status register located in register of comparator instance even (exception for STM32G0 devices featuring ADC3 instance: in common group of COMP2 and COMP3, instances odd and even are inverted), used for bits common to several COMP instances</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Comparator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator input minus selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINUS_1_4VREFINT</name>
                  <description>Comparator input minus connected to 1/4 VrefInt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_2VREFINT</name>
                  <description>Comparator input minus connected to 1/2 VrefInt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_3_4VREFINT</name>
                  <description>Comparator input minus connected to 3/4 VrefInt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>Comparator input minus connected to VrefInt</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH1</name>
                  <description>Comparator input minus connected to DAC1 channel 1 (DAC_OUT1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH2</name>
                  <description>Comparator input minus connected to DAC1 channel 2 (DAC_OUT2)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input minus connected to IO1 (pin PB1 for COMP1, pin PB3 for COMP2, pin PB2 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input minus connected to IO2 (pin PC4 for COMP1, pin PB7 for COMP2, pin PC0 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input minus connected to IO3 (pin PA0 for COMP1, pin PA2 for COMP2, pin PE8 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator plus minus selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input plus connected to IO1 (pin PC5 for COMP1, pin PB4 for COMP2, pin PB0 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input plus connected to IO2 (pin PB2 for COMP1, pin PB6 for COMP2, pin PC1 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input plus connected to IO3 (pin PA1 for COMP1, pin PA3 for COMP2, pin PE7 for COMP3 (for devices featuring COMP3 instance))</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINOUT</name>
              <description>Pair of comparators window output level. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator input hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Hysteresis level low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Hysteresis level medium</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Hysteresis level high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>COMP power mode to high speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to medium speed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKING</name>
              <description>Comparator blanking source</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC4</name>
                  <description>Comparator output blanking source TIM1 OC4 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5</name>
                  <description>Comparator output blanking source TIM1 OC5 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3</name>
                  <description>Comparator output blanking source TIM2 OC3 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3</name>
                  <description>Comparator output blanking source TIM3 OC3 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_OC2</name>
                  <description>Comparator output blanking source TIM15 OC2 (common to all COMP instances: COMP1, COMP2, COMP3 (when available))</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALUE</name>
              <description>Comparator output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCK</name>
              <description>Comparator lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
